In [1]:
# Add matplotlib inline magic command
%matplotlib inline

# Add dependencies
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Declare variables for files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df=pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [4]:
# Read the ride data file and store it in a pandas DataFrame
ride_data_df=pd.read_csv(ride_data_to_load)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [5]:
# Inspect the city data
# 1. Get all the rows that contain null values
# 2. Make sure the driver_count column has an integer data type.
# 3. Find out how many data points there are for each type of city.

In [6]:
#1. Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [7]:
#1. Another way to check - i.e. shows that there are zero null values in all three columns
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
#2. Check data types for each column
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [9]:
#3. Get the unique values in the 'type' column
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [10]:
#3. Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [11]:
#3. Get the number of data points from the Suburban cities.
sum(city_data_df["type"]=="Suburban")

36

In [12]:
#3. Get the number of data points from the Rural cities.
sum(city_data_df["type"]=="Rural")

18

In [13]:
# Inspect the ride data
# 1. Get all the rows that contain null values
# 2. Make sure the fare and ride_id column has an integer data type.

In [14]:
#1. Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [15]:
#1. Another way to check - i.e. shows that there are zero null values in all four columns
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [17]:
#2. Check data types for each column
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [19]:
# Merge the data into a single data set
pyber_data_df=pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban